fun main() {
    println("## Типы данных в Kotlin")
    println()

    // Целочисленные типы
    println("### Целочисленные типы:")
    println("- Byte: 8-битный целочисленный тип (от -128 до 127)")
    println("- Short: 16-битный целочисленный тип (от -32 768 до 32 767)")
    println("- Int: 32-битный целочисленный тип (от -2 147 483 648 до 2 147 483 647)")
    println("- Long: 64-битный целочисленный тип (от -9 223 372 036 854 775 808 до 9 223 372 036 854 775 807)")
    println("- UInt: 32-битный беззнаковый целочисленный тип (от 0 до 4 294 967 295)")
    println("- ULong: 64-битный беззнаковый целочисленный тип (от 0 до 18 446 744 073 709 551 615)")
    println()

    // Типы с плавающей точкой
    println("### Типы с плавающей точкой:")
    println("- Float: 32-битный тип с плавающей точкой")
    println("- Double: 64-битный тип с плавающей точкой")
    println()

    // Тип для символов
    println("### Тип для символов:")
    println("- Char: 16-битный тип для представления символов Unicode")
    println()

    // Тип для строк
    println("### Тип для строк:")
    println("- String: Тип для хранения последовательностей символов")
    println()

    // Логический тип
    println("### Логический тип:")
    println("- Boolean: Тип для представления логических значений (true или false)")
    println()

    // Тип для массивов
    println("### Тип для массивов:")
    println("- Array<T>: Тип для хранения последовательности значений одного типа")
    println()

    // Тип для коллекций
    println("### Тип для коллекций:")
    println("- List<T>: Тип для хранения упорядоченного набора элементов одного типа")
    println("- Set<T>: Тип для хранения неупорядоченного набора уникальных элементов одного типа")
    println("- Map<K, V>: Тип для хранения ассоциативных массивов, где каждый ключ (K) имеет уникальное значение (V)")
    println()

    // Тип для диапазонов
    println("### Тип для диапазонов:")
    println("- IntRange: Тип для представления диапазона целых чисел")
    println()

    // Тип для перечислений
    println("### Тип для перечислений:")
    println("- enum class: Тип для определения набора именованных констант")
}